Tekla Open API Reference for Tekla Structures 2025
EnvironmentFiles Methods
The EnvironmentFiles type exposes the following members.
Methods
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String) |  Obsolete.
 Gets a file info representing the first match in the search directories.
GetAttributeFiles
 Gets attribute files with specified suffix from model, XS_FIRM and XS_PROJECT directories and subdirectories.
GetMultiDirectoryFileList(String)
 Gets a list of files with the given extension from the default search directories.
GetMultiDirectoryFileList(List<String>, String)
 Gets a list of files with the given extension from the given search directories and from XS_FIRM, XS_PROJECT subdirectories.
GetStandardPropertyFileDirectories
 Gets the paths where to look for the property files.
IsValidDirectory
 Checks if a directory is valid.
Top
See Also
Reference
EnvironmentFiles Class
Tekla.Structures.Dialog.UIControls Namespace